{"meta":{"title":"修曦","subtitle":"修身的修，美好之曦","description":"修曦的个人博客——修身的修，美好之曦。曦是美好，是灵魂与心灵的火；是道与理，是永恒与希望的光。成长星火，打造曙光。","author":"Xi","url":"https://xiuxi1.github.io","root":"/"},"pages":[{"title":"","date":"2023-06-22T06:49:10.430Z","updated":"2023-06-22T06:49:10.430Z","comments":true,"path":"about/index.html","permalink":"https://xiuxi1.github.io/about/index.html","excerpt":"","text":"修身的修，美好之曦曦是美好，是灵魂与心灵的火；是道与理，是永恒与希望的光。成长星火，打造曙光 喜欢的可以给个赞赏哦~"},{"title":"404 - 好巧，竟然在这里遇到你！","date":"2022-01-22T12:02:00.000Z","updated":"2023-08-09T03:03:25.875Z","comments":false,"path":"/404.html","permalink":"https://xiuxi1.github.io/404.html","excerpt":"","text":"这是一個不存在的页面对不起，您所访问的页面不存在或者已删除。 预计将在约 5 秒后返回首页。 当然，你可以 点这里 直接返回首页。 let countTime = 5; function count() { document.getElementById('timeout').textContent = countTime; countTime -= 1; if(countTime === 0){ location.href = 'https://xiuxi1.github.io/'; } setTimeout(() => { count(); }, 1000); } count();"},{"title":"所有分类","date":"2023-06-18T12:06:35.563Z","updated":"2023-04-15T07:06:56.000Z","comments":true,"path":"categories/index.html","permalink":"https://xiuxi1.github.io/categories/index.html","excerpt":"","text":""},{"title":"所有标签","date":"2023-06-18T12:06:35.563Z","updated":"2023-04-15T07:07:53.000Z","comments":true,"path":"tags/index.html","permalink":"https://xiuxi1.github.io/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"心无善恶,意识运动，良知为鉴","slug":"心无善恶,意识运动，良知为鉴","date":"2023-08-12T01:09:35.000Z","updated":"2023-08-12T01:21:12.256Z","comments":true,"path":"posts/64d6dbcf.html","link":"","permalink":"https://xiuxi1.github.io/posts/64d6dbcf.html","excerpt":"","text":"无善无恶心之体有善有恶意之动知善知恶是良知为善去恶是格物 古往今来，无数人思索人生的意义，华夏尤甚，中国古代的哲学其实是伦理学，探索人的意义那么多圣贤给出了答案，为什么今天还是有很多人思索人生意义呢。因为我们不只是思索人的意义，更是思索我的意义。很多时候，道理都懂，或是认为道理都懂，但是就是做不到。思索人生意义本身或许就是人生意义，每个人建立自己的理论体系，从而指导自己的实践，在实践中又不断完善自己的理论体系，这种理论体系就是灵魂，是我之为我的根本。无善无恶心之体经过漫长时间进化的人类大脑本来就没有善恶之分，或者说，都是适应生存的。因为进化过程本就是不适者淘汰，都是劣汰，存活到现在的人类，身上的每一个构造，最少是不那么坏的。这些构造自然包括大脑，大脑中的确是有进化过程中遗留下来的思维模式，但是在遇到具体情况之前，还真不一定是善是恶。有善有恶意之动善恶是动态的过程。如果说心之体是进化过程中写好的程序，那么人活着.运行他的大脑.就相当于进程，可以称之为意识。到了现在，这个进程有几个线程，分别按照不同算法演算，即想法，可以称之为念，也就是这里的意之动，哪个想法是正确的呢，哪个念是善的呢，这就要看评判程序：良知。知善知恶是良知什么是良知，良知可以说是灵魂的核心。灵魂是意识运动的一个输出文件，它的名字叫“我”，有的灵魂很混乱，简单说就是不知道自己想要什么，有的灵魂很有秩序，有了体系，对自我的认知很清晰。良知是灵魂的一个线程，是一个评判线程。良知处于一个低功率的常驻状态，当需要评判时，会或主动或被调用的活跃起来。灵魂三问：“我是谁”是对灵魂的整理，“我在哪”是对现在情况的判断，“我要干什么”是对念的调用和评判。当然心之体本身有评判作用，我们称之为本能。良知不是一成不变的，就像灵魂也不是一成不变的。良知在意识运行过程中会随着学习和经历有一些改变，但是大体上是稳定的。我们一定需要遵循良知办事吗？不能反过来吗？不能，因为良知是灵魂的核心，除非你想背弃自己，覆盖旧的灵魂，重塑新的灵魂。需要注意的是，良知不一定就是好的，它只是“我”认为好的，比如：小时候认为的恶可能是现在认为的善。那为什么有时候，良知告诉我该怎么做，我却不会做，甚至做相反的事呢？这不是因为我们不需要遵循良知，而是因为我们的格物出了问题。为善去恶是格物什么是格物，格物是实践，是行动。发展善的想法，抹掉恶的想法，做善的事，不做恶的事，这就是格物，这个物不仅包括我之外的物，还包括灵魂、意识、念等等。因为灵魂本质上是个输出文件，不是操作系统，所以良知不能直接去操作身体格物。那什么才能操作身体呢？是意识本身，或者说一直处于低功率的潜意识。而良知和念都是意识的衍生物。而念纷繁复杂，又有权重极大的本能干扰，所以良知的选择，并不能被潜意识所承认。就是说，用户态进程良知做出的决策不能调用管态的潜意识。那该怎么办呢，增加灵魂自身的秩序性，明确何为我，增加决心，信念和意志。使得灵魂被心承认。就像火绒被win承认。（悄悄说：或者，给潜意识注入病毒，攥取高权限。） 修曦所著，转载注明如果能帮到人就更好啦","categories":[],"tags":[{"name":"结构","slug":"结构","permalink":"https://xiuxi1.github.io/tags/%E7%BB%93%E6%9E%84/"},{"name":"灵魂","slug":"灵魂","permalink":"https://xiuxi1.github.io/tags/%E7%81%B5%E9%AD%82/"}]},{"title":"修曦教——（《曦语》）","slug":"修曦教","date":"2023-08-06T10:58:41.000Z","updated":"2023-08-20T11:42:31.809Z","comments":true,"path":"posts/64cf7ce1.html","link":"","permalink":"https://xiuxi1.github.io/posts/64cf7ce1.html","excerpt":"","text":"《曦语》曦曰：开心就好、更加美好、我心光明、文明光明曦曰：曦者，美好也，灵魂也，火苗也；如虚无中一轮大日，散发璀璨的光辉。曦曰：修者，修身也，成长也，思考与完善也，修习与践行也，实践也；是曦成长的过程，是曦代表之我的各种思考与行为，是其对自己、对他人、对世界的影响。曦曰：修曦者，不断完善自我、修养灵魂也，如不断成长的太阳，如向光生长的树。曦曰：仁者，二人也，即：把自己当人，把他人当人。曦曰：人者，天地万物的意义，宇宙时空的灵魂，世界线的变量。曦曰：我者，人也，曦之具体也，文明的意义，文明的探针，文明之网的完善者，我守护与被守护之人，所有时间之我集合体【大我】在特定时、空、事件的投影。曦曰：我当自矜，当因我之曦而自矜，当因我为我而自矜，当因我为人而自矜。自矜者，贞也，自尊、自爱、自重，如君子、如玉、如出淤泥而不染之莲，是对美好的向往、对堕落的不甘，是天生丽质而难自弃。曦曰：文明者，守护人生长、发展的庇护所也，前人所努力建造、遮挡风雨的房屋也；其由个体发展，又表现在个体上。曦曰：文明当光明。曦曰：文明啊，就是一片被先辈的根稍稍固化的地，让后面的人不必面临饥饿的泥沼、寒冷的泥沼、野兽袭击的泥沼……，他们落下的枝叶果实、他们留下的根，证明着他们的存在，化作春泥，更护新生的树和花。 《曦注》曦注曰：开心者，不言自明也。更加美好者，自己更加美好（思想、灵魂、行为、生活……），让他人更加美好（亲人、爱人、周围人、人……），让社会与文明更加美好。我心光明者：心如花木，向光而生也；心如光球、如大日，思想行为光明也……文明光明者，天下太平，能很好的让每个人发展自己。曦注曰：为天地立心，天地之心为人，又有人为小天地，人之心为【我】、为灵魂，故为天地立心者，明确人为天地之心，人是天地的意义，明确人之基础之心，使人有对自己的基础认知。为生民立命，生民为人民，命者，道路也，故为生民立命者，使人民能够明确自己的发展道路，使人民能走上自己的发展道路，使人民能够好好发展自己，成为自己想要的样子。为往圣继绝学，往圣之绝学者，文明之精华也，其能更好地帮助人明心与发展。万世开太平，万世者，时间很长乃至永恒也，太平者，非只和平也，乃真正光明之文明，人人能发展，社会和谐安定，天下大同……。 未完待续 修曦所著，转载注明如果能帮到人就更好啦","categories":[{"name":"修曦","slug":"修曦","permalink":"https://xiuxi1.github.io/categories/%E4%BF%AE%E6%9B%A6/"}],"tags":[{"name":"修曦","slug":"修曦","permalink":"https://xiuxi1.github.io/tags/%E4%BF%AE%E6%9B%A6/"}]},{"title":"魔法集——个人魔法与言灵的自我修炼与成长","slug":"魔法集——个人魔法与言灵的自我修炼与成长","date":"2023-07-20T03:36:03.000Z","updated":"2023-08-12T06:07:23.352Z","comments":true,"path":"posts/64b8aba3.html","link":"","permalink":"https://xiuxi1.github.io/posts/64b8aba3.html","excerpt":"","text":"【光之瞳】【美好与意义之目】背景：为什么“道理我都懂，但就是做不到啊”，因为好的念头往往不能占据行为的操控权，所以会出现一边想着“呜，不能这样了，快去做（）事吧，对不起，真的不能再这样下去了”一边继续无动于衷的做着不美好且无意义的事，比如刷着手机熬夜，瘫在床上座位上玩手机，一边不想看小说一边看，一边想着起床一边玩手机。而眼睛是最好控制的物理上的器官（与念头相对），又是行为实现的重要工具，看小说刷手机玩游戏等等等等都需要眼睛的参与。所以当不想做当前不美好且无意义的事但又停不下来的时候，就可以闭上眼睛，等待这种惯性慢慢消散，至少还能闭目养神不是。 技能描述：由心灵直接控制，不能目见不美好且无意义之事修炼进度：LV0 22&#x2F;100 【邪恶轨迹匹配】很多〖邪恶〗都是相似的甚至是相同的我们当前的行为发展下去的结果，可能又是之前犯过的〖邪恶〗人怎样才能从历史中学到教训呢？ 光靠经验是不够的，因为惯性、懒惰、逃避、欲望等种种污染会遮蔽心灵，让人就算意识到自己行为的错，也不会去改。我们都知道“防微杜渐”“未雨绸缪”的道理，但就像知道要下雨了得带把伞，却因为“伞拿着不好放开玩”、“也不一定会下雨”、“说不定回家了才下雨呢”、“伞都不知道放哪了”（只是自以为，却不去找）、“淋点小雨也没啥大不了”，最终没带伞。 具体可以表现在：明明过去〖邪恶〗之后，那般懊悔、痛恨，却在现在的同样行为下，觉得过去的自己真是矫情，认为这种犯错的后果也没啥、称不上〖邪恶〗、顶多是〖过度〗，直到又一次的懊悔与痛恨。一次又一次，渐渐的，底线进一步降低，〖邪恶〗真的称不上〖邪恶〗，到了〖过度〗，甚至到了〖常态〗，认为，“人都是这样的”。 〖常态〗〖过度〗〖邪恶〗的解释，简单以熬夜玩手机为例：〖常态〗：23点左右睡觉〖过度〗（小）：玩到了23点半〖过度〗（中）：玩到了零点多〖过度〗（大）：玩到了一点〖邪恶〗：反正玩到了这时候了，于是继续玩到三点甚至通宵。 从〖常态〗到〖过度〗到〖邪恶〗，同种邪恶的轨迹大差不差，不同邪恶的轨迹也有相似之处。就像用“出租车轨迹匹配”来预测出租车目的地，一次〖邪恶〗之后，记下这次〖邪恶〗的轨迹（各种想法和行为），等到遇到相似轨迹，就要挣脱出来，然后仔细思考这次脱离是对是错——因为局中考虑不清楚的、往往局外一目了然——如果脱离对了，就加强这种轨迹匹配；如果脱离错了，就减弱这种轨迹匹配的敏感度，然后再去弥补提前脱离的错误（如果有必要的话）。 【世界线跳跃之术】时间线：不同时间的我世界线：不同选择的我【世界线跳跃之术】{悔恨值达标后，你可使用此术当你使用此术，你可以跳跃到同一时刻相近世界线但需注意由于你没有高维感知此术表现为：“过去时间两个世界线分裂之处的你收到【世界线跳跃之术】的灵感提示那时候的你会出现一个念头指引你走向新的世界线”当过去的你接受信息并成功改变选择你之整体将收到反馈更加与此术相合 （备注：不要忽视向正确方向的念头，那可能是未来悔恨的你，竭尽全力发出的【世界线跳跃之术】。）} 【自行开启的挑战】积累与挑战顺境的积累，逆境的挑战不努力也能好好的顺境，不进则退的逆境量变的积累，质变的挑战生命只能从苦难中成长吗？不是的，顺境也能成长，甚至可能成长的更快，但那大部分是量变；而当生命遇到困境，不进则退，不成功就要付出很大代价，这时候平常的积累便转化为质变。没有挑战的积累，大部分只有量变，本质上成长不了多少。没有积累的挑战，在质变过程中会消耗殆尽积累，最终一样会灭亡。生命进化如此（如基因变异和自然选择），人类发展如此（如生产力的发展和革命），个人发展也是如此 所以，处在顺境的自己，如何自行开启挑战，让自己更好的成长，让自己在更绝望的挑战来临的时候不再无能为力呢？ 奇诡技能：【自行开启的挑战】（奇诡的意思是不可捉摸不可理解不可破解，只能按照其规则做，因果律、规则系、命运，本质上是更高的权限）{【自行开启的挑战】挑战描述：挑战期限：成功奖励：失败惩罚：}技能实现形式：1,言灵、手势、动作、颂（祷）词2,规则书，系统3,人际监督修炼进度：LV0 1&#x2F;30重要程度：5&#x2F;5（超级重要，请尽快习得该技能） 职业【莎莎】选择筛子，世界线修剪者，命运之堤修补者——莎莎 【果果】结果锚定者，世界线收束者，命运之石放置者——果果【摘抄】《玩家超正义》将一段‘可能性的片段’直接置入到‘向前的历史’的某个片段中。这就像是将一块石头、在河流尚未抵达之前置于它的前方一样。但这个时候，石头还仅仅只是虚影而已。如同河流尚未抵达。而为了完成这个目标，‘向前的历史’就会自行改变它的随机性。‘自此处至彼处’的过程，都会为之改变……使得在河流经过那个位置的时候，会推着一块石头、正好落在那个位置。 引导者——【朵朵】决策到行为不止需要能量和监察，还需要不断的引导。想象这个画面：玩泥巴时，一个坑中的水要流入另一个坑中，对于这个决策，要最终完成这个行为，需要一步步把水前往另一个坑方向的土给挖低，把这个沟其他方向低的地方填高，将水引导过去。《演员的自我修养》中说“万能的假使”，即刻意的表演不如设定一个个小情景和小目标，身体自然而然就会完成相应表演。最简单的比如：用手去够一个高处的东西、去摘一朵花，身体自动会完成踮起脚尖、抬头伸手等一系列表演，眼神表情等都会到位。这样的模式体称为朵朵主要魔法：【朵朵全程引导】以起床为例：朵朵全程引导！左手够床边的板凳（执行到位或执行到中途泄气，结果为平躺）双手够脚尖（执行到位或执行到中途泄气，结果为坐起）去拿衣服，好冷呀……一直到比较容易做完剩下动作朵朵引导结束，我们做到啦，真棒！ 众生之父——时刻执剑的帝王有了灵魂结构，决策依据和方法，决策到行为的理论和能量。还需要一个掌握至高权力却时刻执剑的帝王监察世间，遵循灵魂结构，督促决策和行为，净化污染和邪恶。祂是灵魂结构的具象化。称〖祂〗，具体可用自己的名字，或者更适合的名字作为真名。祂身体力行、冲锋在前、肩负责任，祂没有自己的私欲，或者说祂的利益和欲望就是守护众生与美好。祂有权利否决决策、有权利阻止行为、有权利读取一切信息、有权利强制接管身体。祂是一个拥有至高权力的帝王，也是一个守护众生与美好的执剑人。高悬空中，手握刀剑，监察世间屹立身前，身化坚盾，守护灵魂有审判之能，有杀戮之力掌至高权力，护美好之义祂是承担责任、监察世间、守护众生之父 相关魔法：『基态』【祂的注视】使众生敬畏，对污染简单净化，使邪恶偃旗息鼓【祂的承担】祂承担责任和压力，让众生从容决策和行为『激活态』【〖我〗说：皇帝】彻底激活【〖我〗说：洞察】洞察更深信息【〖我〗说：审判】审判决策和行为【〖我〗说：净化】净化污染与邪恶【〖我〗说：剑斩】暴力物理攻击，净化污染与邪恶【〖我〗说：接管】强制接管身体【〖我〗说：守护】坚守本心 活跃有了意义，有了决策依据和方法，有了从决策到行为的理念支撑。还欠缺的，是做出行为的能量。没有能量，就什么都不想做，不想改变，不想做出行动。这时候懒惰和惯性自然占据上风。就好像人累的时候，只想躺平；心累的时候，就只想做些简单重复的事，哪怕并不开心。这样，学也学不好，做也做不好，玩也玩不好。能量充足的时候，哪怕是件简单的小事，都能看出很深刻的道理。哪怕是没什么事，也能主动找到事情做。相关魔法：【吾善养气】去做更能恢复元气的事情，如睡觉，运动，喝水，吃水果。蓄势型技能。【元气满满】调动元气，鼓起精神，持续型输出技能。【过个灵感】调动元气，鼓起精神思考，爆发型输出技能。 选择和行动人的行为有两个动力一是想要，一是应当想要主要是现在快乐应当主要是未来快乐及他人快乐 很多事情其实不必要就好像熬夜玩手机其实你知道没有多开心、也没有多大好处没有想要，也没有应当大多数时候可能只是一种逃避为了对逃避赋予意义于是自我感动所以我们需要更清晰得看待当前选择，做出真正应当和想要的选择和行为 以起床为例：首先列出主要选择：『选择：起床应当值：80想要值：73』『选择：继续睡应当值：35想要值：43』然后根据应当值和想要值依概率选择其中具体值和概率在乎一心（本质上是过去经验的集合，包括进化过程中）选择完成后，很多人还是做不出行动，这是人的懒惰、习惯和行为的惯性影响的，可以看作一种〖污染〗，不用纠结于此。可以消除杂念，集中注意力到要做的行为上，直接做。也可以自己弄出魔法、言灵之类辅助，怎么好用怎么来。例如：『选择为：起床主要阻力：外面好冷阻力可克服选择可执行希尔调动技能【知行合一】（身体掌控），选择将在两分钟后强制执行』 灵魂结构【根本层】①快乐〖我〗快乐现在快乐未来快乐（快乐与否在乎一心，本质上是过去经验的集合，包括进化过程中） 『由己推人』所爱之人快乐拥有所爱之特质的人快乐人类集合体快乐（家庭社会国家民族人类） 『由人推非人』……｛人生意义是快乐｝ ②美好使快乐的状态、事物、行为等等为了快乐的劳动、努力与休息称为美好｛实现快乐的过程为美好｝ 【规则层】③原则美好行为的规则化认识的模块化〖我〗所遵循的基本准则「如：要保持健康」 ④规则未形成原则的一般规则原则的具体化一般不能违背「如：要按时睡觉」【外律层】⑤承诺…… ⑥道德…… ⑦法律…… 修曦所著，转载注明如果能帮到人就更好啦","categories":[],"tags":[]},{"title":"《学而》——（个人想法）","slug":"《学而》——（个人想法）","date":"2023-07-20T03:34:07.000Z","updated":"2023-08-12T01:25:15.011Z","comments":true,"path":"posts/64b8ab2f.html","link":"","permalink":"https://xiuxi1.github.io/posts/64b8ab2f.html","excerpt":"学习而能够时常用到学到的知识实践，这是很快乐的事啊。有知己从远方而来和自己讨论平常周围人都不感兴趣的事，这也是很快乐的事。但是当人们不理解自己做的事，觉得毫无意义，觉得中二，觉得没用，这时候也不要“愠”，不亦君子乎","text":"学习而能够时常用到学到的知识实践，这是很快乐的事啊。有知己从远方而来和自己讨论平常周围人都不感兴趣的事，这也是很快乐的事。但是当人们不理解自己做的事，觉得毫无意义，觉得中二，觉得没用，这时候也不要“愠”，不亦君子乎 学习其实不累，（如果不是非常难，超过当前知识储备太多的话）。但是发现学习的东西又忘了，或者完全用不到，就会觉得好无意义，觉得好累。“学而时习之，不亦说乎”学习的内容能够时常实践（习），是非常快乐的。 子曰：“学而时习之，不亦说乎？有朋自远方来，不亦乐乎？人不知而不愠，不亦君子乎？”学习而能够时常用到学到的知识实践，这是很快乐的事啊。有知己从远方而来和自己讨论平常周围人都不感兴趣的事，这也是很快乐的事。但是当人们不理解自己做的事，觉得毫无意义，觉得中二，觉得没用，这时候也不要“愠”，不亦君子乎（含义1:做到这点就是君子了。含义2:只有君子才能做到这点。含义3:尽量做到这点就更靠近君子了（给自己激励）） 我觉得这样才是正解，整篇才有足够的联系，有足够的意义。 修曦所著，转载注明如果能帮到人就更好啦","categories":[],"tags":[]},{"title":"我曦有圣人之姿——（修曦语录，主要思想）","slug":"我曦有圣人之姿","date":"2023-07-20T02:54:05.000Z","updated":"2023-08-12T01:59:52.337Z","comments":true,"path":"posts/64b8a1cd.html","link":"","permalink":"https://xiuxi1.github.io/posts/64b8a1cd.html","excerpt":"","text":"（暂时不全，待整理补足） 修身篇【自矜】只有认识到自己的重要性，才能【自矜】。我经常说【自矜】，不同于通常所说的自夸，而是一种自尊自爱自重，是一种易经中的【贞】，是天生丽质难自弃、是出淤泥而不染、是我所说的“人擅长于关阀门”中的“洁癖”，是喜欢自己信任自己保护自己，是一种对美好的向往、对堕落的不甘。每一个人都应有对我是【我】的【自矜】，对我是【人】的【自矜】。 【人】可能每一刻的自己（及被影响得更美好的人，（自己留下来的思想和物质））就是人生的意义，正如每个人的生存和发展就是文明的意义、生命的存在和发展是天地的意义。所以不要忧虑：做什么才能让人生有意义，做什么才能奉献社会、文明，做什么才能报答天地。做好每一刻的自己做好自己做一个人 【意义】什么时候会觉得人生没有意义呢？当发现没做什么有用的事、做的事没什么用的时候。开心（好看的小说、好听的歌、好看的东西、灵感来了、得到认同与赞赏）的时候，是不会想人生没有什么意义的（可能那些瞬间就是人生的意义）；但为什么有时候会觉得无意义呢？因为人是善忘的，过去的意义在现在看来就没什么意义，现在的自己——如果不是在经历和当时同样的事情——是不会和当时的自己感同身受的，只有一些过去做的对现在有很大作用的事才会让现在的自己觉得有意义。所以在做一些作用不太持续、或是不太明显、但确实有意义的事（生活中大部分事都是（包括想法））的时候，最好记录下来，对现在和未来来说，很多事情（包括想法）没有记录，就没有发生。但有时候想把脑袋里有用的思维记录下来，却捉摸不到，就像神经网络，只能根据输入得出有灵感的输出，然后推理灵魂的结构。——很多时候，我们并不能很准确地记录，如自己此时认为很有意义的灵魂结构，只能遇到事情或说法之后，再输出想法。这种琐碎的想法，在未来看来，又多半不能完全理解。但好在灵魂是一脉相承、不断发展完善的，我们推理出来的灵魂，会不断逼近理想中的自己。 方法焦虑的正确解决方式待定《易经》之卦（个人理解）【小过】——（及时终止过度的行为）[震上艮下]小过：亨，利贞；可小事，不可大事；飞鸟遗之音，不宜上，宜下，大吉。初六：飞鸟以凶。六二：过其祖，遇其妣；不及其君，遇其臣，无咎。九三：弗过防之，从或戕之，凶。九四：无咎，弗过遇之；往厉必戒，勿用，永贞。六五：密云不雨，自我西郊；公弋取彼在穴。上六：弗遇过之；飞鸟离之，凶，是谓灾眚。山上有雷，山为原则、为心、为我、为灵魂结构，雷为警示、为觉醒、为评判标准、为惩罚手段。保持行为只小小的过分，坚持自矜，自然亨达。各事都有它自己的度，对待每一个行为，其过分程度不同，严重后果不同。飞鸟恰如心猿意马，飞鸟之音，不宜（不是不应，可以，但不能总是，而且尽量不）放纵，而宜克制，此乃大吉。心中不好的念头出现就要警觉，要以凶视之，不能无所谓，不能太放纵；很多时候，一旦开始，停下来就很不容易了，（但也不要太勉强自己，要保持警觉，想好这件事这个行为的度）。行为不太过分就没有咎害，做了就不要太乱想、太自责。没有过分就或过分防御或放纵或讨伐，这样是不好的，（警觉但不激进、不自责）。没有过分就让它，没有害处；快要过分了就一定要及时终止，不要无动于衷、南辕北辙、明知故犯，要一直坚持自矜（坚持这点？感觉这点是全文的概括？）。行为过分了，风雨欲来，就要尽快终止行为，猎杀不好的念头。行为太过分了，没有及时制止，一时已经收不回来，这是极为凶险的，会招致灾祸。举个例子：（有类似经验的人肯定深有体会）晚上睡觉前躺着，想要看小说，心中就要警觉，明确看小说的度，不要像过往一样停不下来。这种念头还好，遇到不算好的念头，就要宜克制，不宜放纵，比如“我就熬一会儿夜”。如果明确了度，确定了能看一会儿小说，就好好地看，不要又反复想着“我这样做不乖”。但是也不要放纵，要保持警觉。当发现再看下去就超过睡觉的时间了，可能会导致熬夜，甚至更加过分的情况，就要赶紧终止，不要再想着”再看一会儿，没关系的，明天休息嘛（明天休息这种情况要提前在度中考虑）。”要一直坚持及时终止，不然一次放纵，就可能次次放纵，直至更加过分。当发现已经很过分了，快造成危害，快造成无法挽回的后果，就要坚定信念，及时终止行为，猎杀念头。当造成循环：“我好困，我是不是不乖了，不开心”，“不开心就看小说，看小说就开心了”，看小说熬夜就更加困，如此恶性循环，就不知道什么时候才能睡了，（有时候我会弄到五点多才能睡），于是学习工作状态不好，身体也受影响，也对自己的结构造成损伤，人也会变得更加不喜欢、不信任自己。总之，念头出现就要保持警觉，明确度；然后玩的时候好好玩，不过度就不要乱想；然后快过度了就要及时终止；过度了就要坚定地斗争、猎杀、终止；不然就会收不住了。链接1 与人篇文明篇摘抄待整理 修曦所著，转载注明如果能帮到人就更好啦","categories":[],"tags":[]},{"title":"“光木水火暗土金”对抗“堕落的深渊”","slug":"“光木水火暗土金”对抗“堕落的深渊”","date":"2023-07-04T11:54:54.000Z","updated":"2023-07-15T06:42:42.777Z","comments":true,"path":"posts/64a4088e.html","link":"","permalink":"https://xiuxi1.github.io/posts/64a4088e.html","excerpt":"【良知之光】【灵魂之木】【柔和之水】【热情之火】【安宁之暗】【踏实之土】【坚定之金】","text":"【良知之光】【灵魂之木】【柔和之水】【热情之火】【安宁之暗】【踏实之土】【坚定之金】 孩子一般比较有灵性，主要是【良知之光】、【柔和之水】（包含活跃）、【热情之火】、【灵魂之木】，但都比较稚嫩。慢慢长大之后，在磨砺中，【热情之火】消退，【良知之光】、【柔和之水】、【灵魂之木】成长，【坚定之金】、【踏实之土】、【安宁之暗】像手上的茧一样被慢慢磨砺出来。然后生出新的【热情之火】，（如果不堕落的话），这时候“七质”都会得到壮大和发展。我现在有【良知之光】、【柔和之水】、【灵魂之木】（小树），这三者得到了很大的成长，但缺少【坚定之金】、【热情之火】、【踏实之土】、【安宁之暗】，所以比较孩子气，甚至比孩子更孩子气；而且主要动力源是水中的活跃，而不是热情，所以就会出现灵感来了特别活跃，平时特别懒惰的情况。（注：拥有和缺少都是相对而言；金木水火土光暗不止一种特性，比如【柔和之水】的水肯定有其他特性；与光对应的不是暗，其实金木水火土光暗为一体，都与“堕落的深渊”对立，“堕落的深渊”一般有“污秽”“过度”“邪恶”“堕落”等等特性。） 【良知之光】向光而生，知道什么是对的，什么是好的，什么是美的，（什么是应该做的，什么是不应该做的，希望，期待，美好，向往） 【灵魂之木】木，灵魂，结构，可以说是主体，如果“七质”是一幅画，那么木是最为显眼的承载物。木承载着水，扎根于土，以金为剑盾（保护与开拓），以火为动力，向着光生长，在暗中休憩。 【柔和之水】水，清澈、柔和、善良、美好、可爱、自由、活跃但水也是最容易堕落的，因为其欠缺结构，当然火也是，但是水是向下的、火是向上的，水更包容，火则焚灭（专注），所以总体来说，还是水更容易堕落，但是水的堕落主要伤害自己，火的堕落更加伤害别人。 【热情之火】火为动力，由光而生。 【安宁之暗】暗，安宁，空无，什么都不想，消除杂念，是很好的休憩，也是对堕落很好的防御。 【踏实之土】脚踏实地，积累，底蕴 【坚定之金】剑与盾，牺牲，守护，就像以死亡为代价保护螃蟹身体的壳与钳，果断，坚定，说一不二。 修曦所著，转载注明如果能帮到人就更好啦","categories":[],"tags":[{"name":"结构","slug":"结构","permalink":"https://xiuxi1.github.io/tags/%E7%BB%93%E6%9E%84/"}]},{"title":"及时终止过度的行为：警醒、制止,节制过度,坚持自矜（【小过】）","slug":"及时终止过度的行为：警醒、制止,节制过度,坚持自矜（【小过】）","date":"2023-06-28T11:02:01.000Z","updated":"2023-08-12T01:40:12.306Z","comments":true,"path":"posts/649c1329.html","link":"","permalink":"https://xiuxi1.github.io/posts/649c1329.html","excerpt":"山上有雷，山为原则、为心、为我、为灵魂结构，雷为警示、为觉醒、为评判标准、为惩罚手段。保持行为只小小的过分，坚持自矜，自然亨达。各事都有它自己的度，对待每一个行为，其过分程度不同，严重后果不同。飞鸟恰如心猿意马，飞鸟之音，不宜放纵，而宜克制，此乃大吉。总之，念头出现就要保持警觉，明确度；然后玩的时候好好玩，不过度就不要乱想；然后快过度了就要及时终止；过度了就要坚定地斗争、猎杀、终止；不然就会收不住了。","text":"山上有雷，山为原则、为心、为我、为灵魂结构，雷为警示、为觉醒、为评判标准、为惩罚手段。保持行为只小小的过分，坚持自矜，自然亨达。各事都有它自己的度，对待每一个行为，其过分程度不同，严重后果不同。飞鸟恰如心猿意马，飞鸟之音，不宜放纵，而宜克制，此乃大吉。总之，念头出现就要保持警觉，明确度；然后玩的时候好好玩，不过度就不要乱想；然后快过度了就要及时终止；过度了就要坚定地斗争、猎杀、终止；不然就会收不住了。 打算通过卜卦学习实践易经中的修身道理。 刚卜了一卦，001100，（用0表示阴，1表示阳），001100是【小过】卦。 注：因为对易经的解读有很多种，我每次会贴出原文和大致解释，然后根据自己的情况和思考写出我自己的理解。需要注意的是，我自己的理解占了很大部分，所以不一定准确，仅供参考。（并且不会看爻，只管修身之理。） [震上艮下] {小过：亨，利贞；可小事，不可大事；飞鸟遗之音，不宜上，宜下，大吉。} 解释1 “小过”，小有越过，小为阴，4条阴爻超过2条阳爻，在小事上太过（过于认真，过越），行事柔弱，‘行过乎恭，丧过乎哀，用过乎俭’，就好像我晒衣服的时候总是要细细调整间距和位置。 “可小事，不可大事”，只做的了小事，做不了大事，“飞鸟遗之音”，飞鸟强行向上飞翔，只会留下悲鸣，（呜，所以是说我做不到我想做的自己吗？），“不宜上，宜下”，也是一个意思，“大吉”，认识到自己的极限，坚持（利贞）做好自己的事，不去勉强，所以大吉（亨）吗？ 解释2 还有一种解释是稍有过失，但不大。坚持自矜（利贞），克制自己，小有过失、小有越过没关系，不要明知故犯、不思悔改，不要做太过分的事，这样就能“亨”，所以小过大吉（感觉就像“蒙”大吉一样）。 “可小事，不可大事”，小事可以稍微过分一些，比如可以懒懒床，但大事不能过分，要负责任，要果断，要做到位，不能马马虎虎、差不多就好。“飞鸟遗之音”，还能听到飞鸟的声音，所以飞鸟并不远，正如过失并不大。“不宜上，宜下”，不能放纵，而应克制，深有体会，放纵着放纵着就没完了，稍微克制一点，最多小过则止。还有“大吉”就不用说了，这个解释的大吉比较明显，所以我也更倾向这个解释，但我也的确有第一个解释的问题。 解释3 写到这里突然有个灵感，所以多写一个好像没人提过的解释：001100，阳在其中为原则，柔在外围包裹，有点外圆内方的感觉，也和我的性格和灵魂结构比较像。小事与大事，现在的人们却是视自己的修身为小事，视功名利禄为大事。飞鸟（吉祥，天使，自由，美好，自然）留下的好听的声音，要深入人心去思考自己、修身养性，而不要急着去争夺。 {《象》曰：山上有雷，小过；君子以行过乎恭，丧过乎哀，用过乎俭。} 解释1 按解释1的解释，很明显是说在小事上太过认真了，但是山上有雷不知何解。 解释2 山上有雷，来警示自己不越界、不过分，山是心是原则，雷是警醒是制止。至于“君子以行过乎恭，丧过乎哀，用过乎俭。“，我认为这么解释：都是君子（大的原则、方向上不出问题）了，在行、丧、用上稍微有点太过，就像偶尔懒懒床一样，都是“小过”，不能太过分，也不能在大事上过分，凡事都有它的度。 （不同的立场看同一件事、同一个句子，得出的结论完全不同呢） 初六：飞鸟以凶。 解释1 1.1、本应安守其位，却动而上进，凶。 1.2、看到飞鸟疾飞而过，却无可奈何，凶。（能力不足，却妄想飞鸟） 解释2 2.1、放纵心中的鸟肆意的飞，凶。 2.2、飞鸟？心猿意马？ 2.3、看到飞鸟疾飞而过，却无动于衷、或无可奈何，凶。 六二：过其祖，遇其妣；不及其君，遇其臣，无咎。 “本爻大旨尚属明确。盖当小过之时，虽可在小事上有所过越，但在大节上不可流于骄纵放肆，更不可以臣欺君、以下犯上。”（两个解释均可用） 九三：弗过防之，从或戕之，凶。 “从读为纵，放任也。戕，杀也，伤也。弗过防之，指未能用超过一般情况的方式来加以防卫；从或戕之，指对眼下处境放任不管则会深受其害。”（偏解释2） 九四：无咎，弗过遇之；往厉必戒，勿用，永贞。 “没有咎害，行为不过分，会遇到它。前往有危险，一定要警戒。不可有所作为，要长久持守贞正。”（偏解释1） 解释2 行为不过分，没有咎害；行为发展的方向有危险，一定要警戒、警示自己，不要一直放任，要坚持自矜。 六五：密云不雨，自我西郊；公弋取彼在穴。 ““密云不雨”，已上也。《小过》谓其‘已上’者，阴过乎阳，而阴已上也，一为阳之过，一为阴之过，皆阴阳不合之象，所以不能为雨也。”此时当谨守“可小事不可大事”之原则，不可贪图有所作为。”（看不懂，但偏解释1） 解释2 行为快过分了，风雨欲来，所以要尽快完成猎杀杂念，行为尽快终止。 上六：弗遇过之；飞鸟离之，凶，是谓灾眚。 ““飞鸟离之”，指鸟高飞于天上，有违“不宜上宜下”之旨。故其身遭凶险，既属天灾，亦属人祸。上六居全卦之终，又在震体，其行动悖逆常理，不能谨慎自持，唯有自遗祸端而已。王弼注：“小人之过，遂至上极，过而不知限，至于亢也。过至于亢，将何所遇？飞而不已，将何所托？灾自己致，复何言哉！”“（偏解释1） 解释2 没有及时制止，行为已经过分，开始了恶性循环，飞鸟已经离去，一时之间再也弄不回来，凶，招致灾祸。 总结： 我对于解释1还没有很深体会，所以更偏解释2。 [震上艮下]小过：亨，利贞；可小事，不可大事；飞鸟遗之音，不宜上，宜下，大吉。初六：飞鸟以凶。六二：过其祖，遇其妣；不及其君，遇其臣，无咎。九三：弗过防之，从或戕之，凶。九四：无咎，弗过遇之；往厉必戒，勿用，永贞。六五：密云不雨，自我西郊；公弋取彼在穴。上六：弗遇过之；飞鸟离之，凶，是谓灾眚。 山上有雷，山为原则、为心、为我、为灵魂结构，雷为警示、为觉醒、为评判标准、为惩罚手段。 保持行为只小小的过分，坚持自矜，自然亨达。各事都有它自己的度，对待每一个行为，其过分程度不同，严重后果不同。飞鸟恰如心猿意马，飞鸟之音，不宜（不是不应，可以，但不能总是，而且尽量不）放纵，而宜克制，此乃大吉。 心中不好的念头出现就要警觉，要以凶视之，不能无所谓，不能太放纵；很多时候，一旦开始，停下来就很不容易了，（但也不要太勉强自己，要保持警觉，想好这件事这个行为的度）。行为不太过分就没有咎害，做了就不要太乱想、太自责。没有过分就或过分防御或放纵或讨伐，这样是不好的，（警觉但不激进、不自责）。没有过分就让它，没有害处；快要过分了就一定要及时终止，不要无动于衷、南辕北辙、明知故犯，要一直坚持自矜（坚持这点？感觉这点是全文的概括？）。行为过分了，风雨欲来，就要尽快终止行为，猎杀不好的念头。行为太过分了，没有及时制止，一时已经收不回来，这是极为凶险的，会招致灾祸。 举个例子：（有类似经验的人肯定深有体会） 晚上睡觉前躺着，想要看小说，心中就要警觉，明确看小说的度，不要像过往一样停不下来。这种念头还好，遇到不算好的念头，就要宜克制，不宜放纵，比如“我就熬一会儿夜”。 如果明确了度，确定了能看一会儿小说，就好好地看，不要又反复想着“我这样做不乖”。但是也不要放纵，要保持警觉。 当发现再看下去就超过睡觉的时间了，可能会导致熬夜，甚至更加过分的情况，就要赶紧终止，不要再想着”再看一会儿，没关系的，明天休息嘛（明天休息这种情况要提前在度中考虑）。”要一直坚持及时终止，不然一次放纵，就可能次次放纵，直至更加过分。 当发现已经很过分了，快造成危害，快造成无法挽回的后果，就要坚定信念，及时终止行为，猎杀念头。 当造成循环：“我好困，我是不是不乖了，不开心”，“不开心就看小说，看小说就开心了”，看小说熬夜就更加困，如此恶性循环，就不知道什么时候才能睡了，（有时候我会弄到五点多才能睡），于是学习工作状态不好，身体也受影响，也对自己的结构造成损伤，人也会变得更加不喜欢、不信任自己。 总之，念头出现就要保持警觉，明确度；然后玩的时候好好玩，不过度就不要乱想；然后快过度了就要及时终止；过度了就要坚定地斗争、猎杀、终止；不然就会收不住了。 修曦所著，转载注明如果能帮到人就更好啦","categories":[],"tags":[{"name":"方法","slug":"方法","permalink":"https://xiuxi1.github.io/tags/%E6%96%B9%E6%B3%95/"}]},{"title":"焦虑的正确解决方式（如何避免用无目的刷手机、玩游戏等方式逃避）","slug":"焦虑的正确解决方式（如何避免用无目的刷手机、玩游戏等方式逃避）","date":"2023-06-28T00:38:10.000Z","updated":"2023-07-15T06:38:54.035Z","comments":true,"path":"posts/649b80f2.html","link":"","permalink":"https://xiuxi1.github.io/posts/649b80f2.html","excerpt":"替代依赖解决问题震慑歧念状态维护","text":"替代依赖解决问题震慑歧念状态维护 替代依赖不开心的时候无目的地玩手机、刷b站、看小说替代为{运动、悠闲、美好、听书做事}1、听好看的小说（提前准备）做简单的事（或者闭目休息、发呆）2、金刚功、长寿功、做运动3、睡觉、洗澡、发呆、喝茶等悠闲的事4、看好看的小说、听好听的歌、看猫猫等美好的事 解决问题状态好了点之后就去积极地解决问题，才能从根本上解决压力、焦虑，而不是做无关的、不美好的、只是逃避的事，让问题更加严重。 震慑歧念需要有个很重要，但又不是不能接受失去的事，来作为锚定物。如不能用“家人”。幸运锚定，做坏事就会变得不幸，乖乖的就会变得好运。 状态维护该睡觉睡觉、该吃饭吃饭，喝水、运动。保持良好状态，才能做好事情、做好自己。 修曦所著，转载注明如果能帮到人就更好啦","categories":[],"tags":[{"name":"方法","slug":"方法","permalink":"https://xiuxi1.github.io/tags/%E6%96%B9%E6%B3%95/"}]},{"title":"思想短篇集————个人想法","slug":"思想短篇集","date":"2023-06-22T01:24:45.000Z","updated":"2023-08-12T05:47:28.226Z","comments":true,"path":"posts/6493a2dd.html","link":"","permalink":"https://xiuxi1.github.io/posts/6493a2dd.html","excerpt":"","text":"文明啊，就是一片被先辈的根稍稍固化的地不美好毋宁死有人说“想要变得更美好，不然还不如死去”听起来很好对吧但是由于种种原因，他却不能死只能在泥沼中苦苦挣扎慢慢看着美好远去看着自己被污染渐渐的变成自己讨厌的人这样的人，世界上有多少呢？于是他开始自暴自弃，开始混日子，开始得过且过，浑浑噩噩，甚至开始做恶，或迫不得已，或为了报复，或，为了满足被污染的欲望这样的人，世界上又有多少呢？ 世人皆处泥沼，或名天赋，或名资源，或名现实，或名时运，或……因人终不能全知全能因事终不能事事如意奈何？又该如何？挣扎罢，挣扎吧哪怕处于泥沼，也要仰望星空，用尽全力，扎根过去，长成一棵向光而生的树稍稍将周围的泥沼固定稍稍庇护所爱之人被污染又如何决不妥协怀着心中那丝希望挣扎罢总归是能稍稍得到一份光总归是能稍稍固化一片地总归是能勉强长成一棵树、开花结果或酸涩、或弱小、或甜蜜…… 文明啊，就是一片被先辈的根稍稍固化的地让后面的人不必面临饥饿的泥沼、寒冷的泥沼、野兽袭击的泥沼……他们落下的枝叶果实他们留下的根证明着他们的存在化作春泥，更护新生的树和花 做好自己就已经特别特别不容易，就已经很好很好了；能做好自己，才是文明的意义管那么多干嘛，过好自己的生活就已经特别特别不容易了。别人的事，谁说的准呢？做好自己，就已经挺不容易，就已经是为社会、人类文明做贡献了，（其实社会、人类文明的发展最终还是落在每个人自己身上，做好自己就像是社会、人类文明的树上开出来的一朵花，虽然表面上看可能对树的生长没什么用，但那才是意义、是灵魂）。做好自己做得差不多了，就稍微、视能力去影响周围的人，特别是家人。修身齐家治国平天下，穷则独善其身 达则兼济天下，都是这样的道理。不是说不去关心社会、关心人类文明，但最应该关心的，其实是自己，是家人；此外，在做好自己的过程中遇到了什么事，再去维权 去修正。每个人都是人类文明的探针，站在各个角落和立场上，在做好自己的同时，去把周围变得更美好，去修正完善触及到的规则，所谓没有调查就没有发言权，在人类文明这张大网上，站在自己的位置、立场，切实接触到的规则之线，才是最有发言权的。当然，我也更佩服那些站在别人位置、立场的人（志愿者，支教，……），他们为那些微弱力量发声，特别令人敬佩。但是对于大多数人来说，做好自己，在自己立场上去看待、去完善人类文明这张大网，就已经很好很好了，或许，偶尔，看到一些微弱的光，就去稍微扶持一下，去帮帮忙，不强求。做好自己就已经特别特别不容易，就已经很好很好了。 “拯救自己”，恰是唯一不可放弃之事『我』，连我自己都舍不得欺负，又哪能让别人欺负。欺负『我』者，无论是他人还是环境，都可视为“危难”，而“拯救自己”，恰是唯一不可放弃之事。什么是“人定胜天”？为了“活下去”、“更好地活下去”，无论什么困难，遇到了，就去解决它，解不决，或是先解决一部分，余下的留给未来的自己、留给后世的人们，或是想办法绕开它，愚公移山精卫填海大禹治水神农百草，不外如是。后来者们啊，我给不了你们万年不熄的神火，我只能告诉你们，火可由人族双手钻木而生，不必求天，不必求神。———燧人氏这种精神，就是华夏万年不熄的“神火”啊，是人类文明的星火——文明之火 无愧于己，方能毫不犹豫地站在自己这边无愧于己，方能毫不犹豫地站在自己这边【我】是天地的意义、是文明的意义、是文明的探针；是守护我之人，是我守护之人；是过去现在未来所有我高维集合之投影。人生唯有一件事不能放弃，那便是拯救自己；人生唯有一种意义不能抛弃，那便是成为自己。如果做不到的话，就算演也得扮演好自己。『我』，连我自己都舍不得欺负，又哪能让别人欺负。 做好自己就已经很辛苦了，做好自己之后，对于委屈自己的事情，就可以心安理得、自信、从容、坚决地拒绝敬酒的人不想喝酒，被敬酒的人也不想喝酒但【为人处世】要求敬酒、要求喝酒做好自己吧，强大自己吧壁立千仞，无欲则刚，不求人就不用委屈自己有能力的人，说“喝酒对身体不好，这局我们喝茶”，也会有人附和，会被人模仿。但人啊，哪能刚开始就有能力。所以，抓紧时间提高自己，在要用到能力之前，拥有能力，才能不求人。做好自己就已经很辛苦了，做好自己之后，对于委屈自己的事情，就可以心安理得、自信、从容、坚决、毫无负担地拒绝。 可以辛苦，但不能委屈，委屈是为利而弃己身，辛苦是为目标（比如说利）而努力奋斗。按自己的节奏生活做事遇到困难挑战不能委屈自己要想办法尽力去解决 比如：如果今天拼命喝酒就能拿下这个项目那就不能拼命喝酒，这是委屈自己而要想办法去解决这个挑战，比如在别的地方表现自己的尊重。或者干脆抱着不奢求的想法，不成也没关系，又不是没钱吃饭。 可以辛苦，但不能委屈，委屈是为利而弃己身，辛苦是为目标（比如说利）而努力奋斗。 修曦所著，转载注明如果能帮到人就更好啦","categories":[],"tags":[{"name":"思想","slug":"思想","permalink":"https://xiuxi1.github.io/tags/%E6%80%9D%E6%83%B3/"}]},{"title":"灵感短篇集——（南辕北辙，掩耳盗铃，刻舟求剑，水至清则无鱼）","slug":"灵感短篇集","date":"2023-06-18T09:57:32.000Z","updated":"2023-08-12T01:44:01.047Z","comments":true,"path":"posts/648ed50c.html","link":"","permalink":"https://xiuxi1.github.io/posts/648ed50c.html","excerpt":"","text":"南辕北辙他不知道正确的方向吗？知道，但不敢掉头、不想掉头、不能掉头，或速度太快，或刹车失灵，或，或是没了心气，觉得目标太远，不想再去做，只想依着惯性，浑浑噩噩，到了更好，没到，没到就没到吧，不重要了。但要是慢慢踩刹车、慢慢转方向，或许路很漫长，或许过程艰难，或许有些难受，但要相信，终有一天，总会离得更近。 掩耳盗铃有时候，我们知道自己错了，知道可能会有严重后果，但不敢面对，只想逃避，不想做减轻后果之事，便如克制不住诱惑去盗铃，铃响却只想着掩耳，明知道理，却不去做，明知方法，却不实施。小时候觉得这个人好蠢现在呢？ 刻舟求剑有的时候，当剑掉下去的一瞬间，我们就已经知道再也找不到了，只能刻舟留个念想。事后，一遍遍的悔恨，一遍遍的寻找，知道找不到了，知道回不去了，但总想着弥补什么、做点什么。逝去的亲人，失去的白月光（替身），逝去的时光，以及，那越行越远的，理想中的自己 水至清则无鱼水至清则无鱼，会不会不是因为水太清了，所以没有鱼；而是因为有了鱼，水才慢慢变浑浊（各种有机碎屑，动植物尸体，浮游生物），于是从外界观察“水至清则无鱼”。同理，不是因为社会环境太清明，所以没有人喜欢；而是因为有了很多人，于是利益纠缠之下，社会环境就变得很复杂。“水至清则无鱼”后面还有一句“人至察则无徒”，这个其实也有另一种说法。“人至察则无徒”：“察”人太严了就没有朋友。但是，当你去真正深层次地去看每一个人的人生、做某件事的经过（人至察），大多数时候（除了一些非常邪恶的情况），你就会理解他们，会觉得情有可原，所谓“公说公有理，婆说婆有理”，你站在他&#x2F;她的角度去看，会发现还真有他&#x2F;她的道理。看到老虎捕食小鹿，你会想小鹿多可怜啊，但是看到老虎把带回去的食物给嗷嗷待哺的小老虎吃，你又会觉得老虎也是没办法。所以人至察，则处处都是朋友。 修曦所著，转载注明如果能帮到人就更好啦","categories":[],"tags":[{"name":"灵感来了","slug":"灵感来了","permalink":"https://xiuxi1.github.io/tags/%E7%81%B5%E6%84%9F%E6%9D%A5%E4%BA%86/"}]},{"title":"从“这一拳，大道都磨灭了”—到—“失道而后德，失德而后仁，失仁而后义，失义而后礼。”—到—“绝仁弃义”","slug":"从“这一拳，大道都磨灭了”—到—“失道而后德，失德而后仁，失仁而后义，失义而后礼。”—到—“绝仁弃义”","date":"2023-06-18T07:32:52.000Z","updated":"2023-07-15T05:00:55.555Z","comments":true,"path":"posts/648eb324.html","link":"","permalink":"https://xiuxi1.github.io/posts/648eb324.html","excerpt":"","text":"还记得那句“不是你撞的，你为啥要扶？”吗？有人调侃：“这一拳，大道都磨灭了。”但这句话，还真可以解释。 『灵感来了』《道德经》有云：“失道而后德，失德而后仁，失仁而后义，失义而后礼。”又有“大道裂，百家出”。在碰瓷出现之前，看到地上倒了个人，去把他扶起是不需要什么思考，天经地义的事。这就是“道”。在“不是你撞的，你为啥要扶？”出现之前一段时间，随着碰瓷事件的逐渐增多，“道”其实有了越来越多的裂纹，直到那一拳，“道”磨灭了，人们再不敢心无顾忌、自然而然地去扶人。 “失道而后德”“道”磨灭后，只有有德行的人，才能不顾自己可能的损失，依然选择去扶。这就是“德”。但碰瓷越来越多，敢扶的人越来越少。 “失德而后仁”何为“仁”？按我之前的说法，“仁”就是两个人，是“我是人，你也是人”，是把人当人看，是“将心比心”“推己及人”。当仁人看到路上的老人，虽然不是毫无顾忌、不是没有犹豫，但他推己及人，想着要是自己躺在那，该多么希望有人能扶自己一把。于是便扶了，纵使可能遇到碰瓷，但哪怕有百分之一（这时候还没到万一的程度）的可能是真的，就值得。但碰瓷事件愈加增多，后果愈发严重。 “失仁而后义”这时候，扶人遇到碰瓷的概率很大，后果十分严重，人们实在不敢去扶了。于是义士出现，舍生死来捍卫心中的道理，用文采武力（包括法律武器、舆论等等）来保证自己的安全。 “失义而后礼”当义士也愈发失望：当舆论不再站在自己这边，当关系纠缠，官方也给不到公正。人们，看着地上的人死去，也不会再扶。及时救助本可以活的人越来越多，官方或民间的人实在不能忽视，于是便有了要求人们去做的“礼”或“法”，但人们再不是真心去做的了。 “绝仁弃义”有人说，“绝圣弃智，绝仁弃义”便是重启世界，让人们重新开始。但重新开始的人们，又怎么不会再迈上这条堕落之路呢？有人说，那留下物资，这样新世界的人们有了充足的物资，就能实现大同。但这又何尝不是另一种“伊甸园”，总会有“蛇”来诱惑人们。那该如何解决呢？实际上，道德经那句话还可以反过来看，完善礼而后有义，不负义而后有仁，人人仁而后有德，德遍布而后成道。礼法完善（不管是民间还是官方）之后，有义士敢去舍己为人，替天行道，首先迈出第一步。“士为知己者死”，士和知己者便成了“仁”。保持这个势头，后面的事情自然而然。这才是真正的“绝仁弃义，复归于道”。有人说，“道理我都懂，但就是回不去了啊，看到那令人心寒的事件，心里留下的阴影，便怎么也消不去了。还不如消除这些事件的信息，等到几代人之后，人们不再记得这种事，便能不再被影响。”不是这样的历史得到的经验教训不该这么抹去，不然人们只会再犯。如果这代人做不到复归于道，那就下代人，下下代人，……，每一个觉悟的人都做好自己，以自己的心去对待周围的人和事，去教育下一代，为遇到的人以身作则，如此下去，终会复归于道。而那时的道，比原来的道，更加成长壮大。 修曦所著，转载注明如果能帮到人就更好啦","categories":[],"tags":[{"name":"灵感来了","slug":"灵感来了","permalink":"https://xiuxi1.github.io/tags/%E7%81%B5%E6%84%9F%E6%9D%A5%E4%BA%86/"}]},{"title":"黔驴技穷背后的无奈与反击之道——（灵感来了）","slug":"黔驴技穷背后的无奈与反击之道——（灵感来了）","date":"2023-06-11T23:54:53.000Z","updated":"2023-08-12T01:48:53.761Z","comments":true,"path":"posts/64865ecd.html","link":"","permalink":"https://xiuxi1.github.io/posts/64865ecd.html","excerpt":"","text":"关于黔驴技穷这个故事“传说黔（现贵州一带）本来没有驴，有人从外地带了一头驴去，放养在山脚下。老虎看它是个庞然大物，叫声很响，起初很害怕，躲得很远。后来逐渐接近它并加以戏弄，驴大怒踢了老虎一脚。老虎高兴地说：本领不过如此罢了！就上去把驴咬死吃了。后用“黔驴技穷”比喻反面人物本领低劣，有限的一点伎俩也已经用完了。” 黔驴技穷，却又何其无奈驴本来就不属于黔，也不适应黔的环境，却被人强行带过来。被老虎欺负戏弄的驴忍了又忍，警告、呼救、反抗，没用啊，还能怎样？于是爆发，却被探清虚实，吃干抹净，何其无奈。有人说继续忍着就没事了，但“沉默呵，沉默呵，不在沉默中爆发，就在沉默中灭亡”。这个故事，明明是“好事者”和“老虎”欺负人，为什么偏偏说驴是反面角色，还“伎俩”，他又没做什么坏事。我们可以续写故事：有一天，有好事者运了头大象过来，老虎有了之前的经验，觉得不过是另一头黔驴罢了，于是戏弄它，大象忍着忍着，老虎越来越放肆，终于有一天，老虎攻击了大象，大象发现老虎的攻击力也不高，于是轻而易举地干掉了老虎。这个故事的名字可以叫“黔虎技穷”，比喻坏人能力不足，却不自量力。这样才对。 那么，驴初到黔到底该怎么做呢？ 黔驴技穷的解法正常来说，是慢慢发展自己、认知老虎，直到能力足够。但驴只有一条命，不像文明，所以驴的时间特别少，在短时间内，如何面对远超自己的老虎呢？最简单的办法是狐假虎威，说“我是人的驴，人带我到这的，你欺负我，人会打死你。”所以说“找关系”“送礼”有时候也是没办法。但那样只能保一时，要尽快增强自己，这才是正道。 黔驴技穷另一种解法拼命打疼他如果被校园欺凌，警告没用呼救没用哀求没用，狐假虎威没用，告家长老师没用。那么，拼着命不要也要打疼对方。假如一群人欺负，就拼命抓着一个人打，宁死也要把对方打成重伤，打出心理阴影。让对方知道，欺负人不是不用付出代价的，欺负人不能用玩乐心态，再欺负，就豁出命来拉一个垫背。自损一万伤敌一千，如果要吃掉我，那你就付出一条腿的代价，治不好的那种。再结合狐假虎威，并竭力发展自己，黔驴技穷就能解了。 修曦所著，转载注明如果能帮到人就更好啦","categories":[],"tags":[{"name":"灵感来了","slug":"灵感来了","permalink":"https://xiuxi1.github.io/tags/%E7%81%B5%E6%84%9F%E6%9D%A5%E4%BA%86/"}]},{"title":"愿众生光明——（如竟没有星火，便打造自己的曙光；照亮自己，也照亮他人）","slug":"愿众生光明","date":"2023-06-10T13:00:04.000Z","updated":"2023-08-12T02:06:01.817Z","comments":true,"path":"posts/648473d4.html","link":"","permalink":"https://xiuxi1.github.io/posts/648473d4.html","excerpt":"","text":"年少的我们站在路上看向远方的路被阳光沐浴“等我站在那里，一定会很美好吧”我们遥望，满怀期待 我们走在路上慢慢长大有时候遇到岔路或不以为意或被诱惑或想离光更近 可是啊当我们走到那个期待的附近却发现自己早已偏离身心俱疲，昏暗不定回过头来去看原来，那时的自己方才离光更近那一双眼睛里面蕴含光明 我们正有能力被期待的我们是继续前行，披荆斩棘亦或留在原地，任由凋零虽然注定到不了期待之地但往前走未尝没有更好的风景虽然周身黯淡无光但向前进未必不能再放光明 拯救自己，唯一不能放弃向光而行，贯穿所有光阴 虽然可能到不了光明但近一点，更近一点总不能放任自己堕入深渊就此腐烂无动于衷地变成自己讨厌的人 何况前路，谁说的准呢说不定，这是黎明前最暗的夜再往前一步便能柳暗花明 如竟没有星火便打造自己的曙光照亮自己，也照亮他人 愿众生光明 修曦所著，转载注明如果能帮到人就更好啦","categories":[],"tags":[{"name":"我","slug":"我","permalink":"https://xiuxi1.github.io/tags/%E6%88%91/"}]},{"title":"我给自己做系统——*扮演理想中的自己；有序化、系统化灵魂，形成结构；玩好人生游戏*","slug":"我给自己做系统","date":"2023-06-10T00:41:22.000Z","updated":"2023-08-12T06:02:38.625Z","comments":true,"path":"posts/6483c6b2.html","link":"","permalink":"https://xiuxi1.github.io/posts/6483c6b2.html","excerpt":"","text":"【我给自己做系统】扮演理想中的自己；有序化、系统化灵魂，形成结构；玩好人生游戏 理论依据1234567891011121314年少的我们站在路上， 看向远方的路被阳光沐浴， “等我站在那里，一定会很美好吧”， 我们遥望，满怀期待。 我们走在路上， 慢慢长大， 有时候遇到岔路， 或不以为意， 或被诱惑， 或想离光更近。 可是啊， 当我们走到那个期待的附近， 却发现自己早已偏离， 身心俱疲，昏暗不定， 回过头来去看， 原来，那时的自己， 方才离光更近， 那一双眼睛， 里面蕴含光明。 我们正有能力， 被期待的我们， 是继续前行，披荆斩棘， 亦或留在原地，任由凋零， 虽然注定到不了期待之地， 但往前走， 未尝没有更好的风景， 虽然周身黯淡无光， 但向前进， 未必不能再放光明。 拯救自己，唯一不能放弃， 向光而行，贯穿所有光阴。 虽然可能到不了光明， 但近一点，更近一点， 总不能， 放任自己堕入深渊， 就此腐烂， 无动于衷地变成自己讨厌的人。 何况前路，谁说的准呢， 说不定，这是黎明前最暗的夜， 再往前一步， 便能柳暗花明。 如竟没有星火， 便打造自己的曙光， 照亮自己，也照亮他人。 愿众生光明。(20230611)文明，是守护人生长、发展的庇护所，是前人努力建造的、遮挡风雨的房屋；文明由个体发展，又表现在个体上，，每一个个体都是文明之网的完善者、是文明的探针。(20230610)做好自己才是文明的意义与灵魂，每个人自己都是文明的探针，做好自己就已经特别特别不容易了，就已经很好很好了。(20230609)未来的世界那么美好，要好好活下去呀。(20230525)每个人都只有一个工作———扮演理想中的自己。抽象地说，向光的方向；具体地说，让自己和人更美好。(20230524)等价扮演；真我扮演。(20230523)人生中只有一件事不能放弃，那就是拯救自己，不是性命，而是心灵。(20230520)璀璨。(20230520)一鼓作气，再而衰，三而竭。三而竭又怎么样呢？总不能不做了啊！请你务必一而再，再而三，三而不竭，千次万次，毫不犹豫地救自己于危难。为你，为我，为人类，为文明，为天地，千千万万遍。(20230506)从物理的角度认知世界，从魔法的角度看向世界，以扮演的方式做好自己，以科学的方法填充实践。(20230504)我曦有圣人之姿，以身作则，证明自己的道路，寻找人类的出路。(20230504) 为天地立心(人是天地的意义，是变量，是灵），为生民立命（命就是道路，让人民知道该怎么走，让人民都能走在他们自己的道路上，成为一个个真正的人（人人如龙，人人成仙）），为往圣继绝学（这个绝学是——【文明】！），为万世开太平（也是【文明】）。 (20230424)活下去，更好地活下去。(20230424)…… 修曦语录12345678910与其寻找，不如成为，成为不了，便去扮演，实在不行，就留下自己的思想，待后世的人啊，补全自己的向往。『我』，连我自己都舍不得欺负，又哪能让别人欺负。欺负『我』者，无论是他人还是环境，都可视为“危难”，而“拯救自己”，恰是唯一不可放弃之事。抓紧时间提高自己，在要用到能力之前，拥有能力，才能不求人。做好自己就已经很辛苦了，做好自己之后，对于委屈自己的事情，就可以心安理得、自信、从容、坚决、没有负担地拒绝。什么是“人定胜天”？为了“活下去”、“更好地活下去”，无论什么困难，遇到了，就去解决它，解不决，或是先解决一部分，余下的留给未来的自己、留给后世的人们，或是想办法绕开它，愚公移山精卫填海大禹治水神农百草，不外如是。后来者们啊，我给不了你们万年不熄的神火，我只能告诉你们，火可由人族双手钻木而生，不必求天，不必求神。———燧人氏。。这种精神，就是华夏万年不熄的“神火”啊，是人类文明的星火——文明之火无愧于己，方能毫不犹豫地站在自己这边【我】是天地的意义、是文明的意义、是文明的探针；是守护我之人，是我守护之人；是过去现在未来所有我高维集合之投影。人生唯有一件事不能放弃，那便是拯救自己；人生唯有一种意义不能抛弃，那便是成为自己。不要对别人抱有十分的期待，而要对自己，因为，其实，大多数时候，你对自己的期待，也不到十分，甚至完全没有。但，不论何时，都要对自己抱有期待好吗，还是那句话：“拯救自己”，是唯一不可放弃之事。每天的精力就像流量包，不用就浪费了。每天的时间是有限的，想要过得开心，就不要往自己身上揽太多事，包括一些以娱乐的名义占据时间的事。去做一些真正能让自己开心，切实为自己带来收获的事情。其余时候不如闲着，什么都不做可能会比浑浑噩噩地做要好。腾出时间才能更好地去用时间，浑浑噩噩去做事才是真正的浪费时间（当然有些”不干正事儿”也能做）。为什么说事不过三，是让你见好就收，一般在第2次的时候就应该结束，如果在第2次不满足的话，可以第3次，虽然两次不满足，但给过一次机会也差不多了，可要是第二次还行，再开始第三次，那就有无数次的风险，因为如果第三次满足，那会觉得自己今天运气好，就会想一直玩下去，如果不满足，又放不下，就会突破限制，限制一旦被突破，多少次都有可能。好好地做自己吧，放心地去展现自己，只用稍稍收敛自矜。喜欢你的，会发现你更多的好；讨厌你的，如果讨厌的是你自己也讨厌的地方，那么就正好改进它；如果讨厌的是你自己喜欢的地方，那你们的路就不一样，不用去管他；如果讨厌的是你不喜欢也不讨厌的地方，那就求同存异，改进完善也好，稍稍收敛也好，积极发展也好。好好做自己吧，其他人都有人做了；每个人在做自己上都有天赋，有很长时间的努力、经验和教训。 四角色守护 我来承担，但你要乖 乖乖 可以任性，但须可爱 空白 静谧、虚无 曙光 拯救、自矜 三模式清醒模式沉浸模式托管模式三原则随心所欲不逾矩清新淡笃不过度中正平和不染邪前车之覆南辕北辙明明向往美好，却总是做不美好的事，停不下来。就像反方向行驶的车，浑浑噩噩，依着惯性前行，明明不是想要的方向，但什么都不想做，，也可能是掉头太过困难，想做也做不到。慢慢转方向盘吧，可能会绕远路，但总比什么都不做要好，，可能做着做着，就柳暗花明了呢。 任务模块主线任务支线任务日常任务…… 数据模块基本属性值 精力、潜力、注意力、…… 统计值实时快乐值范围 0：100当实时快乐值低于35，建议暂停当前事件，思考是否有必要继续，并提供能量变换事件。 单位时间快乐值（分类方式：事件、时间、……）正面事件1234事件：听深深唱歌快乐值：82 &lt;超级开心，深深唱歌真好听~&gt;统计值：2 &lt;0611，0612&gt;最近更新时间：20230612上午听歌起床写博客听歌 12345事件：刷手机前20分钟快乐值：80 &lt;开心，深深和小朋友真可爱&gt;统计值：1 &lt;0612&gt;最近更新时间：20230612醒来至起床备注：20分钟后开心值迅速下降，20分钟觉得很少，但是30分钟就会感觉很多，会有负罪感（倒也没有“罪”那么严重），真的好看就会更开心，刷不到好看的就会不开心，建议5分钟刷不到好看的就别刷了。 负面事件123456事件：特别无意义地做事快乐值：8 &lt;特别不快乐，或是偶尔有些许快乐（但总的来说不快乐）&gt;举例：刷手机，明明b站推荐暂时没什么好看的了，但还是一直一直刷新；明明一本小说不好看，但还是看啊看，看到想吐还看。有时候就不明白了，熬夜看一本不喜欢看的小说，明明很难受，明明想睡觉，但就是停不下来，就是不去睡。原因：逃避，惯性（南辕北辙）统计值：1 &lt;0611&gt;最近更新时间：20230611上午下午 …… 魔法模块 言灵、…… 技能模块 灵感、…… 成就模块…… 修曦所著，转载注明如果能帮到人就更好啦","categories":[{"name":"我","slug":"我","permalink":"https://xiuxi1.github.io/categories/%E6%88%91/"},{"name":"系统","slug":"我/系统","permalink":"https://xiuxi1.github.io/categories/%E6%88%91/%E7%B3%BB%E7%BB%9F/"}],"tags":[{"name":"我","slug":"我","permalink":"https://xiuxi1.github.io/tags/%E6%88%91/"}]},{"title":"以人为本，做好自己——（其实啊，人活着，做好自己就够了，就已经挺不容易了）","slug":"以人为本，做好自己","date":"2023-05-04T00:45:42.000Z","updated":"2023-08-12T02:03:29.811Z","comments":true,"path":"posts/64530036.html","link":"","permalink":"https://xiuxi1.github.io/posts/64530036.html","excerpt":"","text":"其实啊，人活着，做好自己就够了，就已经挺不容易了；自己都养不好，又谈何去养孩子养父母为公司社会国家人类做贡献。文明觉悟是要人人觉悟的，社会的进步最终还是要落到每个人个体身上，人人如龙，文明才能健康的成长。如果说政治正确，那“活下去”是人类第一政治正确，“好好活着”是人类第一共识。没有人不想好好活着，对美好生活的向往是每个人每个家庭每个社会国家乃至人类内心的渴望。每个人的能力有高有低，但高也不可能高到全知全能，低也不可能低到毫无价值。在“好好活着”基础上再按自己的能力去做一些事。不必要非得拼命为了谁，为了未来，说不定那个人，说不定未来的你，反而会希望你开开心心的，好好地度过你该有的生活。能力低本身并不可怕，就像“童蒙”是大吉。人类的能力也远不止他们现在表现出的那样，在我们好好生活之后，我们的潜力反而会极大提升，做出的事情可能（其实我觉得是一定）比勉强自己做出的成就要更大。物质决定意识没错，生产力在社会发展中的确起到重要甚至决定性作用，但不能轻视人类意识的涌现（文明，这个脱胎于物质的东西，才是人类乃至宇宙的灵魂）。真正的灵魂，是人本身。为什么非要把灵魂，看作物质上存在的东西呢，其实它，更像是一个伦理学概念吧。中国古代的哲学，与其说是哲学，不如说，是伦理学啊，那是一座真正的宝藏。特别是与其他国家对比之后。修身齐家治国平天下为天地立心，人才是万物之灵，才是真正需要重视之物。为生民立命，让人民不迷茫，让人民能够走在他们自己的道路上，知道前方（能够看到希望）知道过往（能够汲取教训）知道现在（知道该做与不该做并切实去做）。什么是命？命就是自己的道路啊。为往圣继绝学，不管是对于人的思考，还是其他知识，甚至包括各种器物的创造和使用技巧，物质的财富也可以包括在这，往圣的绝学是——文明，往圣并不只是那些大人物，而是人们本身。为万世开太平，太平、太平，还是那句话，人们，只想好好活着啊。 修曦所著，转载注明如果能帮到人就更好啦","categories":[],"tags":[]},{"title":"电车难题——（灵感来了）——个人想法","slug":"电车难题","date":"2023-05-01T13:49:29.000Z","updated":"2023-08-12T01:31:08.937Z","comments":true,"path":"posts/644fc369.html","link":"","permalink":"https://xiuxi1.github.io/posts/644fc369.html","excerpt":"","text":"关于电车难题类似问题我们应该首先避免事故的发生如果事故发生，则尽量降低受害者群体的死亡概率，并且不牵连无辜者群体如果牵连了无辜者群体，则视为故意杀人，该怎么处罚怎么处罚，该给什么赔偿给什么赔偿 对于自动驾驶公司来说牺牲乘客还是冲向行人问题首先应该尽量避免事故的发生事故发生后那牺牲乘客，因为乘客是受害者群体，乘坐该公司的汽车有死亡概率如果冲向行人的损失较小，有些公司可能会选择冲向行人，但是要视为故意杀人，该怎么判怎么判。除非这条路上的行人签署了相关协议，自动驾驶公司每人发多少钱用做保险（对于行人来说是投资，用自身的风险来换取利益，这样签署协议的人群就不是无辜者） 对于传统电车难题来说一个人和5个人肯定选5个人活，因为这降低了受害者群体的死亡概率，每个受害者在绑上铁轨前都会认同死亡概率低的，但是不能把桥上的人推下去，因为他属于无辜者群体，如果推下去了，则视为故意杀人。当然这都是把人看作抽象人，只考虑人和其利益关系，属于底线中的底线，如同法律一样 修曦所著，转载注明如果能帮到人就更好啦","categories":[],"tags":[{"name":"灵感来了","slug":"灵感来了","permalink":"https://xiuxi1.github.io/tags/%E7%81%B5%E6%84%9F%E6%9D%A5%E4%BA%86/"}]},{"title":"何以为我——（过去与生前等价）","slug":"何以为我","date":"2023-04-23T10:48:39.000Z","updated":"2023-08-12T01:35:20.125Z","comments":true,"path":"posts/64450d07.html","link":"","permalink":"https://xiuxi1.github.io/posts/64450d07.html","excerpt":"","text":"何以为我人之初，性本善还是本恶？都不是。人初生之时，本就没有所谓善恶，非要说的话，那就是善。因为我们的身体，我们的大脑，我们延伸出来的意识，我们的一切一切，那都是在进化过程中，或多或少发挥过作用以适应环境的，最少也是不那么影响适应环境的。所以并没有所谓善恶，善恶都是对于当前环境来说的，非要说，那就是善，是大善、泛善、进化过程漫长时间的善。人之初，就像买电脑时预装好的操作系统——因为多数人并不了解操作系统以下的部分，所以——就像预装好一些软件（如360安全卫士）的电脑，它们臃肿冗余，有很多很多其实你并不需要的功能，但这些软件、预装好的模块能让你更“简单”的操作身体，但是，并不如意。有些功能你并不需要，如激光扫描器；有些功能你虽然需要，但不想要过度，比如总是联网、占用内存的Windows自动更新；有些功能你有时候非要不可，但是一打开就会卡死、沉溺于其中，比如wps。这些功能，有人说是欲望，放纵它们的化为魔，克制它们的修仙，不用它们的修佛，笛卡尔的二元论也有灵与肉的提法。那何以为我？我就是我想要的部分功能构成的系统。听起来有些像循环论证，问你“我”，你怎么回答“我”就是“我想要的”，我都不知道谁是我，怎么有“我想要的”，又怎么定义“我”。是这样的，就像神经网络一样，“我”是一个有模糊边界的概念，我们可以从评价功能入手，也就是基本的“良知”，这个“良知”及其评价认同的就是“我”，但是这不一定充分，也不一定必要，只能说有大部分是良知的认同，但有良知认同的非我，也有非良知认同的我，因为良知是动态发展的，我也是动态发展的，就像带点肉的部分灵，就像吃点肉的佛，就像有自己原则有点善良的魔，最为符合的，可能就是仙了，是（但不全是也不都是）《长生可否》中的仙，也像乖乖中带点任性的小孩。（这里有点复杂，以后有灵感再详说）再往前推一步，过去与生前等价，现在的我便如人之初，今日种种譬如今日生，过去的经历、过去汲取的信息、过去的实践、过去的种种，可以算是一种小进化过程。所以过去与生前等价，现在便是人之初。以过去训练出良知，良知认定聚集基本我，基本我边界模糊。我是谁，从大环境中基本区分出我；我在哪，定义出与我交互的部分环境；我要干什么，基于我的目的，做出我的决策。有的人“我”很散，只能使用过去提供的软件环境。有的人的“我”很凝实，会用火绒，会改注册表，禁止一些不想要功能，禁止不了的在其触发时及时关闭，会监测进程运行时间，如果时间过长会视情况挂起进程，会做好优先级。这样的“我”知道自己想要什么，并且有相应的能力去促进自己想要的，去禁止、减缓自己不想要的。（先写到这，未完待续） 修曦所著，转载注明如果能帮到人就更好啦","categories":[],"tags":[{"name":"我","slug":"我","permalink":"https://xiuxi1.github.io/tags/%E6%88%91/"}]}],"categories":[{"name":"修曦","slug":"修曦","permalink":"https://xiuxi1.github.io/categories/%E4%BF%AE%E6%9B%A6/"},{"name":"我","slug":"我","permalink":"https://xiuxi1.github.io/categories/%E6%88%91/"},{"name":"系统","slug":"我/系统","permalink":"https://xiuxi1.github.io/categories/%E6%88%91/%E7%B3%BB%E7%BB%9F/"}],"tags":[{"name":"结构","slug":"结构","permalink":"https://xiuxi1.github.io/tags/%E7%BB%93%E6%9E%84/"},{"name":"灵魂","slug":"灵魂","permalink":"https://xiuxi1.github.io/tags/%E7%81%B5%E9%AD%82/"},{"name":"修曦","slug":"修曦","permalink":"https://xiuxi1.github.io/tags/%E4%BF%AE%E6%9B%A6/"},{"name":"方法","slug":"方法","permalink":"https://xiuxi1.github.io/tags/%E6%96%B9%E6%B3%95/"},{"name":"思想","slug":"思想","permalink":"https://xiuxi1.github.io/tags/%E6%80%9D%E6%83%B3/"},{"name":"灵感来了","slug":"灵感来了","permalink":"https://xiuxi1.github.io/tags/%E7%81%B5%E6%84%9F%E6%9D%A5%E4%BA%86/"},{"name":"我","slug":"我","permalink":"https://xiuxi1.github.io/tags/%E6%88%91/"}]}